tutorials/MFM_BO_Tutorial/LF/system/.ipynb_checkpoints/blockMeshDict-checkpoint
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-0.3 0     0)     // 0
    (1    0     0)     // 1
    (1    0     0.5)   // 2
    (-0.3 0     0.5)   // 3

    (-0.3 0.35  0)     // 4
    (1    0.35  0)     // 5
    (1    0.35  0.5)   // 6
    (-0.3 0.35  0.5)   // 7
);

blocks
(
    hex (0 1 5 4 3 2 6 7) (24 8 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    plate
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }

    tunnel
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 6 7)
        );
    }
);