tutorials/MFM_BO_Tutorial/LF/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5.14 0 0);

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
	offset          (0 0 0);
	setAverage      off;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    "(plate|hemisphere)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    tunnel
    {
        type  		slip;
    }

    symmetry
    {
        type 		symmetryPlane;
    }

}


// ************************************************************************* //
